src/cf/maERP_ib/src/InformationRegisters/ПрисоединённыеФайлы/ПрисоединённыеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрисоединённыеФайлы</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Внешний</name>
    <comment>Признак хранения файла на диске</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>DefinedType.КоличествоНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ВладельцыПрисоединенныхФайлов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Связь</name>
    <comment>Связь со внутренним реквизитом объекта</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <comment>Идентификатор файла, так же служит для связи c файлом на диске</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/maERP_ib/src/CommonModules/ПрисоединённыеФайлыВызовСервера/Module.bsl
#Область Интерфейс

Функция ПодготовитьФайлыДляПередачиНаКлиент(МасКлючи, ИдентификаторФормы) Экспорт
	Результат = Новый Массив;
	МасДанные = ПолучитьДанныеПоКлючам(МасКлючи);
	Для Каждого Запись Из МасДанные Цикл
		Если Запись.Внешний Тогда
			Файл = Новый Файл(Запись.ДанныеФайла.ПолноеИмя);
			Если Не Файл.Существует() Тогда Продолжить КонецЕсли;
		КонецЕсли;
		Описание = Новый ОписаниеПередаваемогоФайла;
		Описание.Хранение = ?(Запись.Внешний, ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Запись.ДанныеФайла.ПолноеИмя), ИдентификаторФормы), Запись.НавигационнаяСсылка);
		Описание.Имя = Запись.ИмяИсходное;
		Результат.Добавить(Описание);
	КонецЦикла;	
	Возврат Результат		
КонецФункции

Процедура ЗаписатьДанныеПрикреплённыхФайлов(Объект, Связь, ДанныеФайлов) Экспорт
	ВнешнийФайл = Константы.ХранитьФайлыНаДиске.Получить();
	Для Каждого Стр Из ДанныеФайлов Цикл
		МЗ = РегистрыСведений.ПрисоединённыеФайлы.СоздатьМенеджерЗаписи();
		МЗ.Объект = Объект;
		Если ЗначениеЗаполнено(Связь) Тогда
			МЗ.Связь = Связь;
		КонецЕсли;
		МЗ.ID = Новый УникальныйИдентификатор;
		МЗ.ИмяФайла = Стр.ИмяФайла;
		МЗ.Внешний = ВнешнийФайл;
		МЗ.Расширение = Стр.Расширение;
		МЗ.Размер = Стр.Размер;
		ПоместитьФайлВХранилище(МЗ, Стр.Адрес);
		МЗ.Записать(Истина);
		УдалитьДанныеИзВременногоХранилища(Стр.Адрес);
	КонецЦикла;
КонецПроцедуры

Процедура ПоместитьФайлВХранилище(Менеджер, Адрес) Экспорт
	Если Не ЭтоАдресВременногоХранилища(Адрес) Тогда Возврат КонецЕсли; 
	ДД = ПолучитьИзВременногоХранилища(Адрес);
	Если Менеджер.Внешний Тогда
		Структура = СформироватьИмяФайлаНаДиске(Менеджер);
		УдалитьФайлы(Структура.Каталог, Структура.ИмяБезРасширения + ".*");
		ДД.Записать(Структура.ПолноеИмя);	
	Иначе	
		Менеджер.Данные = Новый ХранилищеЗначения(ДД, Новый СжатиеДанных(9));
	КонецЕсли;
КонецПроцедуры 

Процедура УдалитьДанныеИзВременногоХранилища(Адрес) Экспорт
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
        УдалитьИзВременногоХранилища(Адрес);
	КонецЕсли;
	Адрес = "";	
КонецПроцедуры

Функция ПолучитьМассивУдаляемыхФайлов(Знач МасКлючи) Экспорт
	СтрРезультат = Новый Структура("МассивУдаляемыхФайлов,МассивТиповОбъектовФайлов",Новый Массив,Новый Массив);
	Для Каждого Ключ Из МасКлючи Цикл
		Запись = ПолучитьДанныеПоКлючу(Ключ);
		Если Не Запись.Внешний Тогда Продолжить КонецЕсли;
		СтрРезультат.МассивУдаляемыхФайлов.Добавить(Запись.ДанныеФайла.ПолноеИмя);
		Если СтрРезультат.МассивТиповОбъектовФайлов.Найти(ТипЗнч(Запись.Объект)) = Неопределено Тогда
			СтрРезультат.МассивТиповОбъектовФайлов.Добавить(ТипЗнч(Запись.Объект))	
		КонецЕсли;
	КонецЦикла;
	Возврат СтрРезультат;
КонецФункции

Функция УдалитьФайлыСДиска(Мас) Экспорт
	Для Каждого Стр Из Мас Цикл
		УдалитьФайлы(Стр);	
	КонецЦикла;	
КонецФункции

#КонецОбласти

#Область Дополнительно

Функция ПолучитьДанныеПоКлючу(Знач Ключ)
	Если ТипЗнч(Ключ) = Тип("Структура") Тогда
		Ключ = РегистрыСведений.ПрисоединённыеФайлы.СоздатьКлючЗаписи(Ключ);	
	КонецЕсли;	
	МЗ = РегистрыСведений.ПрисоединённыеФайлы.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, Ключ);
	МЗ.Прочитать();
	Результат = Новый Структура("Объект, ИмяФайла, ID, Внешний, Комментарий, Размер, Расширение");
	ЗаполнитьЗначенияСвойств(Результат, МЗ);
	Результат.Вставить("ИмяИсходное", МЗ.ИмяФайла + "." + МЗ.Расширение);
	Результат.Вставить("ДанныеФайла", ?(МЗ.Внешний, СформироватьИмяФайлаНаДиске(Результат), Неопределено));
	Результат.Вставить("НавигационнаяСсылка", ?(МЗ.Внешний, Неопределено, ПолучитьНавигационнуюСсылку(Ключ, "Данные")));
	Возврат Результат;		
КонецФункции

Функция ПолучитьДанныеПоКлючам(МасКлючи)
	Результат = Новый Массив;
	Для Каждого Ключ Из МасКлючи Цикл		
		Результат.Добавить(ПолучитьДанныеПоКлючу(Ключ));	
	КонецЦикла;	
	Возврат Результат
КонецФункции

Функция СформироватьИмяФайлаНаДиске(Знач Запись)
	Результат = Новый Структура;
	Результат.Вставить("Каталог", Константы.КаталогХраненияФайлов.Получить() + "\" + Запись.Объект.УникальныйИдентификатор()); 
	КаталогНаДиске = Новый Файл(Результат.Каталог);
	Если Не КаталогНаДиске.Существует() Тогда
		СоздатьКаталог(Результат.Каталог);	
	КонецЕсли;
	Результат.Вставить("ИмяБезРасширения", СокрЛП(Запись.ID));
	Результат.Вставить("Расширение", Запись.Расширение);
	Результат.Вставить("Имя", Результат.ИмяБезРасширения + "." + Результат.Расширение);
	Результат.Вставить("ПолноеИмя", Результат.Каталог + "\" + Результат.Имя);
	Возврат Результат;
КонецФункции

#КонецОбласти
